{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.13.0", "signature": {"inputs": {"conv2d_1_input": {"name": "conv2d_1_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}, "outputs": {"dense_2": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9216"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "conv2d_1_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["conv2d_1_input", "StatefulPartitionedCall/sequential_1/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1/Relu", "StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_2/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/sequential_1/flatten_1/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/flatten_1/Reshape", "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_1/Relu", "StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_1/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_2/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 898}}, "weightsManifest": [{"paths": ["group1-shard1of100.bin", "group1-shard2of100.bin", "group1-shard3of100.bin", "group1-shard4of100.bin", "group1-shard5of100.bin", "group1-shard6of100.bin", "group1-shard7of100.bin", "group1-shard8of100.bin", "group1-shard9of100.bin", "group1-shard10of100.bin", "group1-shard11of100.bin", "group1-shard12of100.bin", "group1-shard13of100.bin", "group1-shard14of100.bin", "group1-shard15of100.bin", "group1-shard16of100.bin", "group1-shard17of100.bin", "group1-shard18of100.bin", "group1-shard19of100.bin", "group1-shard20of100.bin", "group1-shard21of100.bin", "group1-shard22of100.bin", "group1-shard23of100.bin", "group1-shard24of100.bin", "group1-shard25of100.bin", "group1-shard26of100.bin", "group1-shard27of100.bin", "group1-shard28of100.bin", "group1-shard29of100.bin", "group1-shard30of100.bin", "group1-shard31of100.bin", "group1-shard32of100.bin", "group1-shard33of100.bin", "group1-shard34of100.bin", "group1-shard35of100.bin", "group1-shard36of100.bin", "group1-shard37of100.bin", "group1-shard38of100.bin", "group1-shard39of100.bin", "group1-shard40of100.bin", "group1-shard41of100.bin", "group1-shard42of100.bin", "group1-shard43of100.bin", "group1-shard44of100.bin", "group1-shard45of100.bin", "group1-shard46of100.bin", "group1-shard47of100.bin", "group1-shard48of100.bin", "group1-shard49of100.bin", "group1-shard50of100.bin", "group1-shard51of100.bin", "group1-shard52of100.bin", "group1-shard53of100.bin", "group1-shard54of100.bin", "group1-shard55of100.bin", "group1-shard56of100.bin", "group1-shard57of100.bin", "group1-shard58of100.bin", "group1-shard59of100.bin", "group1-shard60of100.bin", "group1-shard61of100.bin", "group1-shard62of100.bin", "group1-shard63of100.bin", "group1-shard64of100.bin", "group1-shard65of100.bin", "group1-shard66of100.bin", "group1-shard67of100.bin", "group1-shard68of100.bin", "group1-shard69of100.bin", "group1-shard70of100.bin", "group1-shard71of100.bin", "group1-shard72of100.bin", "group1-shard73of100.bin", "group1-shard74of100.bin", "group1-shard75of100.bin", "group1-shard76of100.bin", "group1-shard77of100.bin", "group1-shard78of100.bin", "group1-shard79of100.bin", "group1-shard80of100.bin", "group1-shard81of100.bin", "group1-shard82of100.bin", "group1-shard83of100.bin", "group1-shard84of100.bin", "group1-shard85of100.bin", "group1-shard86of100.bin", "group1-shard87of100.bin", "group1-shard88of100.bin", "group1-shard89of100.bin", "group1-shard90of100.bin", "group1-shard91of100.bin", "group1-shard92of100.bin", "group1-shard93of100.bin", "group1-shard94of100.bin", "group1-shard95of100.bin", "group1-shard96of100.bin", "group1-shard97of100.bin", "group1-shard98of100.bin", "group1-shard99of100.bin", "group1-shard100of100.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Conv2D/ReadVariableOp", "shape": [3, 3, 1, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.44325507481892906, "scale": 0.0032592284913156547, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07353770119302414, "scale": 0.0008550895487560946, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.33471545834167327, "scale": 0.0025166575815163406, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06694729889140409, "scale": 0.0006086118081036736, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/MatMul/ReadVariableOp", "shape": [9216, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.14026891145051695, "scale": 0.0012413178004470526, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11177996210023469, "scale": 0.0005080907368192486, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/MatMul/ReadVariableOp", "shape": [128, 10], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.49773910700106155, "scale": 0.00363313216789096, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12601504743683573, "scale": 0.000845738573401582, "original_dtype": "float32"}}]}]}